In [1]:
import random
from numpy.random import randint
from numpy.random import rand
import pandas as pd
import datetime
import numpy as np
from tqdm import tqdm
import matplotlib.pyplot as plt

In [2]:
!pwd

'pwd'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [3]:
location = "data/"

machine_info = pd.read_csv(location + "machine_info.csv")
order_info = pd.read_csv(location + "order_info.csv")

In [4]:
machine_info.head()

     item  machine  capacity
0  050060    433.0      1.08
1  050093    404.0      7.13
2  050093    408.0      4.67
3  050093    410.0      4.50
4  050093    416.0      3.92

In [6]:
order_info =order_info.rename(columns={
    '영업납기':'time',
    '중산도면':'item',
    '단가':'cost',
    '수량':'qty',
    '선급':'urgent'
})

machine_info =machine_info.rename(columns={
    'JSDWG':'item',
    'MCNO':'machine',
    'AVG_CT':'capacity'
})

In [7]:
order_info.head()

         time    item   cost  qty urgent
0  2021-05-13  K04033  25870  318    검사품
1  2021-05-24  K04031  16229  383    검사품
2  2021-05-30  051718   8333   19    NaN
3  2021-06-03  056984  36533    4    NaN
4  2021-06-18  057791  45500  196    검사품

In [8]:
machine_info.head()

     item  machine  capacity
0  050060    433.0      1.08
1  050093    404.0      7.13
2  050093    408.0      4.67
3  050093    410.0      4.50
4  050093    416.0      3.92

In [9]:
order_info['urgent'] = order_info['urgent'].fillna(0)

for i in range(len(order_info)):
    if order_info.loc[i, 'urgent'] != 0:
        order_info.loc[i, 'urgent'] = 1

#전처리 (3) time type부여
order_info['time'] = order_info['time'].apply(lambda x: datetime.datetime.strptime(x, '%Y-%m-%d'))

In [10]:
order_info

          time    item    cost  qty urgent
0   2021-05-13  K04033   25870  318      1
1   2021-05-24  K04031   16229  383      1
2   2021-05-30  051718    8333   19      0
3   2021-06-03  056984   36533    4      0
4   2021-06-18  057791   45500  196      1
..         ...     ...     ...  ...    ...
122 2021-08-15  Z00807   10450  300      0
123 2021-08-18  069559  242250   28      1
124 2021-08-19  K00614    6750   12      0
125 2021-08-31  K04037    7810  400      1
126 2021-09-15  Z00807   10450  325      0

[127 rows x 5 columns]

In [11]:
machine_info.value_counts()

item    machine  capacity
050060  433.0    1.08        1
K00347  404.0    11.05       1
K00337  438.0    40.00       1
        437.0    7.13        1
        410.0    8.77        1
                            ..
058398  408.0    4.61        1
        404.0    4.17        1
058396  438.0    7.08        1
        434.0    6.30        1
Z01415  409.0    9.50        1
Length: 21149, dtype: int64

In [12]:
order_info.describe()

                cost         qty
count     127.000000  127.000000
mean    45204.133858  114.110236
std     81277.077503  140.706450
min      2990.000000    2.000000
25%     11551.000000   20.000000
50%     21160.000000   48.000000
75%     35816.500000  169.000000
max    481190.000000  716.000000

In [13]:
machine_info.describe()

            machine      capacity
count  21149.000000  21151.000000
mean     420.686132     10.441903
std       12.071250     18.304675
min      401.000000      0.050000
25%      409.000000      3.200000
50%      424.000000      5.500000
75%      433.000000     10.500000
max      442.000000    930.000000

In [ ]:
#월별 생산 주문 보기
date_start =[
    '2021-01-01',
    '2021-02-01',
    '2021-03-01',
    '2021-04-01',
    '2021-05-01',
    '2021-06-01',
    '2021-07-01',
    '2021-08-01',
    '2021-09-01',
]

for i in range(len(date_start)-1):
    check_df =order_info[(order_info['time']>date_start[i])&(order_info['time']<date_start[i+1])
        ]
    print(f'{date_start[i]} ~ {date_start[i+1]}생산 주문 건 수: {len(check_df)}')